benchmarksuite/interfaceCapturing/advection/vortexShearedDisc/vortexShearedDisc/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "simulationParameter"

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr                  2;
        nAlphaSubCycles             $SUBCYL;
        cAlpha                      1;

        interfaceCapturingScheme             $ADVECTSCHEME;
        interfaceRepresentation        $RECONSCHEME;


        vof2IsoTol          1e-8;
        surfCellTol         1e-8;
        writeVTK            false;
        snapTol             0;
        nAlphaBounds        10;
        clip                false;
    }




}

isoAdvector
{
    period	16;
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     -1;
    nNonOrthogonalCorrectors -1;
    nAlphaCorr      1;
    nAlphaSubCycles 1;
    cAlpha          1;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
